src/Catalogs/ЧислоПаденийРабочихПроцессов/ЧислоПаденийРабочихПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЧислоПаденийРабочихПроцессов</name>
  <owners>Catalog.ПоказателиМониторинга</owners>
  <owners>Catalog.ПоказателиОповещений</owners>
  <owners>Catalog.ПоказателиИнцидентов</owners>
  <attributes>
    <name>АвтоМасштаб</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВременноеСмещение</name>
    <type>
      <types>EnumRef.ВариантыСмещенияВременногоОкна</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсеСерверы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменилосьСглаживание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменился</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменилсяВид</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалУсреднения</name>
    <type>
      <types>EnumRef.ИнтервалыУсреднения</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТипаПоказателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьДанныеЗаПрошлыйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТренд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийСервер</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСглаживания</name>
    <type>
      <types>EnumRef.ТипыСглаживания</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПадения</name>
    <type>
      <types>EnumRef.ТипыПаденияРабочегоПроцесса</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/Дампы/Дампы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Дампы</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВОчередиНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Обрабатывается</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КаталогЭкспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасположениеТЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогВременныхФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеОбработкиДампа</name>
    <type>
      <types>EnumRef.СостоянияОбработкиДампа</types>
    </type>
  </resources>
  <attributes>
    <name>ИмяБезРасширения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВременногоАрхива</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАрхивирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияАрхивирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЭкспорта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияЭкспорта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующегоПовтора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДампа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.Оборудование</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВариантДампа</name>
    <type>
      <types>CatalogRef.ВариантыДампов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяФайлаДампа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДампа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыПаденияРабочегоПроцесса/ТипыПаденияРабочегоПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПаденияРабочегоПроцесса</name>
  <enumValues>
    <name>СОбразованиемДампа</name>
  </enumValues>
  <enumValues>
    <name>БезОбразованияДампа</name>
  </enumValues>
  <enumValues>
    <name>СОбразованиемИБезОбразованияДампа</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ЧислоПаденийРабочихПроцессов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьМассивСтруктурыПоказателей(ТипПоказателя, ИдентификаторНастройки, МассивСтруктурПоказателей, ТолькоВыбранные) Экспорт
	
	МассивСтруктурыПоказателей = Новый Массив;
	
	ТаблицаПоказателей = Новый ТаблицаЗначений;
	ТаблицаПоказателей.Колонки.Добавить("ПоказательМониторинга", Новый ОписаниеТипов("СправочникСсылка.ПоказателиМониторинга"));
	ТаблицаПоказателей.Колонки.Добавить("ГруппаОбъектовКонтроля", Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтруктураПоказатель Из МассивСтруктурПоказателей Цикл
		
		Если ЗначениеЗаполнено(СтруктураПоказатель.Показатель) И СтруктураПоказатель.ТипПоказателя = "ЧислоПаденийРабочихПроцессов" Тогда
			
			НоваяСтрока							= ТаблицаПоказателей.Добавить();
			НоваяСтрока.ПоказательМониторинга	= СтруктураПоказатель.Показатель;
			НоваяСтрока.ГруппаОбъектовКонтроля	= СтруктураПоказатель.ГруппаОбъектовКонтроля;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ИдентификаторНастройки", ИдентификаторНастройки);
	Запрос.УстановитьПараметр("ТаблицаПоказателей", ТаблицаПоказателей);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаПоказателей.ПоказательМониторинга КАК ПоказательМониторинга,
	|	ТаблицаПоказателей.ГруппаОбъектовКонтроля КАК ГруппаОбъектовКонтроля
	|ПОМЕСТИТЬ
	|	ТаблицаПоказателей
	|ИЗ
	|	&ТаблицаПоказателей КАК ТаблицаПоказателей
	|
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаПоказателей.ПоказательМониторинга.Наименование Как Код,
	|	ТаблицаПоказателей.ПоказательМониторинга КАК ПоказательМониторинга
	|ИЗ
	|	ТаблицаПоказателей КАК ТаблицаПоказателей
	|ГДЕ
	|	ТаблицаПоказателей.ГруппаОбъектовКонтроля
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код
	|";
	
	СтруктураДанныхГруппы = Новый Структура();
	СтруктураДанныхГруппы.Вставить("ПоказательМониторинга", "");
	СтруктураДанныхГруппы.Вставить("ОбъектКонтроля", "ГруппаОбъектовКонтроляРодитель");
	СтруктураДанныхГруппы.Вставить("Код", "Группы дампов");
	СтруктураДанныхГруппы.Вставить("МассивСтрок", Новый Массив());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура();
		СтруктураДанных.Вставить("ПоказательМониторинга", Строка(Выборка.ПоказательМониторинга.УникальныйИдентификатор()));
		СтруктураДанных.Вставить("ОбъектКонтроля", "ГруппаОбъектовКонтроля");
		СтруктураДанных.Вставить("Код", Выборка.Код);
		СтруктураДанных.Вставить("МассивСтрок", Новый Массив());
		
		СтруктураДанныхГруппы.МассивСтрок.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	МассивСтруктурыПоказателей.Добавить(СтруктураДанныхГруппы);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЧислоПаденийРабочихПроцессов.ТипПадения КАК ТП,
	|	Дампы.ОбъектКонтроля.Наименование КАК СерверНаименование,
	|	Представление(ТипыПаденияРабочегоПроцесса.Ссылка) КАК ТипПаденияНаименование,
	|	Дампы.ОбъектКонтроля КАК Сервер,
	|	ТипыПаденияРабочегоПроцесса.Ссылка КАК ТипПадения,
	|	ТипыПаденияРабочегоПроцесса.Порядок КАК ТипПаденияПорядок,
	|	ЕСТЬNULL(ТаблицаПоказателей.ПоказательМониторинга, Неопределено) КАК ПоказательМониторинга
	|ИЗ
	|	РегистрСведений.Дампы КАК Дампы
	|
	|	ПОЛНОЕ СОЕДИНЕНИЕ Перечисление.ТипыПаденияРабочегоПроцесса КАК ТипыПаденияРабочегоПроцесса
	|	ПО Истина
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЧислоПаденийРабочихПроцессов КАК ЧислоПаденийРабочихПроцессов
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПоказателей КАК ТаблицаПоказателейОтбор
	|		ПО ТаблицаПоказателейОтбор.ПоказательМониторинга.Показатель = ЧислоПаденийРабочихПроцессов.Ссылка
	|		И НЕ ТаблицаПоказателейОтбор.ГруппаОбъектовКонтроля
	|
	|	ПО ЧислоПаденийРабочихПроцессов.РабочийСервер = Дампы.ОбъектКонтроля
	|	И ЧислоПаденийРабочихПроцессов.ТипПадения = ТипыПаденияРабочегоПроцесса.Ссылка
	|	И НЕ ЧислоПаденийРабочихПроцессов.ВсеСерверы
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоказателей КАК ТаблицаПоказателей
	|	ПО ТаблицаПоказателей.ПоказательМониторинга.Показатель = ЧислоПаденийРабочихПроцессов.Ссылка
	|
	|ГДЕ
	|	Дампы.ОбъектКонтроля <> ЗНАЧЕНИЕ(Справочник.ОбъектыКонтроля.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СерверНаименование, ТипПаденияПорядок
	|
	|ИТОГИ 
	|	МАКСИМУМ(СерверНаименование) КАК СерверНаименование,
	|	МАКСИМУМ(ПоказательМониторинга) КАК ПоказательМониторинга
	|ПО
	|	Сервер
	|";
	
	ВыборкаСервер = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сервер");
	Пока ВыборкаСервер.Следующий() Цикл
		
		Если ТолькоВыбранные И НЕ ЗначениеЗаполнено(ВыборкаСервер.ПоказательМониторинга) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураДанныхСервер = Новый Структура();
		СтруктураДанныхСервер.Вставить("ПоказательМониторинга", "");
		СтруктураДанныхСервер.Вставить("Код", ВыборкаСервер.СерверНаименование);
		СтруктураДанныхСервер.Вставить("ОбъектКонтроля", Строка(ВыборкаСервер.Сервер.УникальныйИдентификатор()));
		СтруктураДанныхСервер.Вставить("МассивСтрок", Новый Массив());
		
		ВыборкаТипПадения = ВыборкаСервер.Выбрать();
		Пока ВыборкаТипПадения.Следующий() Цикл
		
			Если ТолькоВыбранные И НЕ ЗначениеЗаполнено(ВыборкаТипПадения.ПоказательМониторинга) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураДанныхТипПадения = Новый Структура();
			
			Если ЗначениеЗаполнено(ВыборкаТипПадения.ПоказательМониторинга) Тогда
				СтруктураДанныхТипПадения.Вставить("ПоказательМониторинга", Строка(ВыборкаТипПадения.ПоказательМониторинга.УникальныйИдентификатор()));
			Иначе
				СтруктураДанныхТипПадения.Вставить("ПоказательМониторинга", "");
			КонецЕсли;
			
			СтруктураДанныхТипПадения.Вставить("Код", ВыборкаТипПадения.ТипПаденияНаименование);
			СтруктураДанныхТипПадения.Вставить("ОбъектКонтроля", Строка(ВыборкаТипПадения.Сервер.УникальныйИдентификатор()) + "/" + Метаданные.Перечисления.ТипыПаденияРабочегоПроцесса.ЗначенияПеречисления[ВыборкаТипПадения.ТипПаденияПорядок].Имя);
			СтруктураДанныхТипПадения.Вставить("МассивСтрок", Новый Массив());
			
			СтруктураДанныхСервер.МассивСтрок.Добавить(СтруктураДанныхТипПадения);
			
		КонецЦикла;
		
		МассивСтруктурыПоказателей.Добавить(СтруктураДанныхСервер);
		
	КонецЦикла;
	
	Возврат МассивСтруктурыПоказателей;
	
КонецФункции

Функция ПоискПоказателей(Знач СтрокаПоиска) Экспорт
	
	СтрокаПоиска = СтрЗаменить(СтрокаПоиска, """", "");
	
	МассивРезультатов = Новый Массив;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""Дампы/"" + Дампы.ОбъектКонтроля.Наименование КАК Представление,
	|	Дампы.ОбъектКонтроля КАК Сервер,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПаденияРабочегоПроцесса.СОбразованиемИБезОбразованияДампа) КАК ТипПадения
	|ИЗ
	|	РегистрСведений.Дампы КАК Дампы
	|ГДЕ
	|	Дампы.ОбъектКонтроля.Наименование ПОДОБНО &СтрокаПоиска
	|	И Дампы.ОбъектКонтроля <> ЗНАЧЕНИЕ(Справочник.ОбъектыКонтроля.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураРезультата = Новый Структура();
		СтруктураРезультата.Вставить("Представление", Выборка.Представление);
		СтруктураРезультата.Вставить("ОбъектКонтроля", Строка(Выборка.Сервер.УникальныйИдентификатор()) + "/СОбразованиемИБезОбразованияДампа");
		СтруктураРезультата.Вставить("ТипПоказателя", "ЧислоПаденийРабочихПроцессов");
		
		МассивРезультатов.Добавить(СтруктураРезультата);
		
	КонецЦикла;
	
	Возврат МассивРезультатов;
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Описание
	|ИЗ
	|	Справочник.ЧислоПаденийРабочихПроцессов
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", Данные.Ссылка);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Представление = Выборка.Описание;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
